views/layouts/main.php

//    $settings = Yii::$app->params['settings'];

    /* @var $all_settings \app\models\Settings[] */
    $all_settings = \app\models\Settings::find()->asArray()->all();
---
SELECT * FROM `settings`