views/invoice/_form.php

    function supplierUpdate(){
        $.post("/supplier/bankdata?id="+$(this).val(),function( data ) {
            var json = $.parseJSON(data);
            $( "input#invoice-account_prefix" ).val( json.account_prefix );
            $( "input#invoice-account_number" ).val( json.account_number );
            $( "input#invoice-bank_code" ).val( json.bank_code );
            $( "input#invoice-iban" ).val( json.iban );
            $( "input#invoice-swift" ).val( json.swift );
            $( "input#invoice-ks" ).val( json.ks );
            $( "input#invoice-info" ).val( json.info );
        });
    }', View::POS_END, "supplierUpdate");
?>

<div class="invoice-form">

    <?php $form = ActiveForm::begin([ "options" => ["id" => 'invoice-form', 'enctype' => 'multipart/form-data']]); ?>

    <?= $form->errorSummary($model); ?>




    <script>
        var cislo_firmy = "<?= app\models\Settings::find()->where(["setting" => "COMPANY_ID"])->one()->value ?>";
---
SELECT * FROM `settings` WHERE `setting`='COMPANY_ID'