controllers/InvoiceController.php

    public function actionIndex()
    {
        $searchModel = new InvoiceSearch();
        $searchModel->radio = 1;
        $searchModel->load(Yii::$app->request->get());
        $dataProvider = $searchModel->searchText(Yii::$app->request->get());
        $supplier_list_home = Yii::$app->cache->get("supplier_list");
        if (!$supplier_list_home){
            $query1 = Supplier::find()->joinWith("invoices")->groupBy("supplier.id")->orderBy("COUNT(invoice.id) DESC")->limit(10);
            $query2 = Supplier::find()->joinWith("invoices")->groupBy("supplier.id")->orderBy("COUNT(invoice.id) DESC")->offset(10);
            $suppliers_best = Supplier::find()->from([$query1])->orderBy("name")->all();
---
SELECT `supplier`.* FROM `supplier` JOIN `invoice` ON invoice.id_supplier = supplier.id GROUP BY `supplier`.`id` ORDER BY COUNT(invoice.id) DESC LIMIT 10
SELECT `supplier`.* FROM `supplier` JOIN `invoice` ON invoice.id_supplier = supplier.id GROUP BY `supplier`.`id` ORDER BY COUNT(invoice.id) DESC LIMIT 10, 18446744073709551615
SELECT * FROM (SELECT `supplier`.* FROM `supplier` LEFT JOIN `invoice` ON `supplier`.`id` = `invoice`.`id_supplier` GROUP BY `supplier`.`id` ORDER BY COUNT(invoice.id) DESC LIMIT 10) `0` ORDER BY `name`

    public function actionCreate()
    {
        $model = new Invoice();
        $post = Yii::$app->request->post();
		$get = Yii::$app->request->get();

        if ($model->load($post)) {
            $model->date_1 = date("Y-m-d H:i:s", strtotime($model->date_1));
            $model->date_2 = date("Y-m-d H:i:s", strtotime($model->date_2));
            $model->date_3 = date("Y-m-d H:i:s", strtotime($model->date_3));
            $cislo_firmy = \app\models\Settings::find()->where(["setting" => "COMPANY_ID"])->one()->value;
            $model->_typ_dokladu = $post['typ_dokladu'];
            $typ_dokladu = $post['typ_dokladu'];
            $aktualny_uctovny_rok = (isset($get["year"])) ? substr($get["year"],2) : date("y");
            $model->internal_number =
                    $cislo_firmy.
                    $typ_dokladu.
                    $aktualny_uctovny_rok.
                    $this->actionSerialnumber($cislo_firmy, $typ_dokladu, $aktualny_uctovny_rok);


            $model->supplier = Supplier::find()->where(["id" => $model->id_supplier])->one()->name;
---
SELECT * FROM `settings` WHERE `setting`='COMPANY_ID'
SELECT * FROM `supplier` WHERE `id`='2176'

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $model->_typ_dokladu = substr($model->internal_number, 1,1);

        $type = -1;
        if (in_array($model->_typ_dokladu, ["5", "7"])){
            $type = 0;
        } else if (in_array($model->_typ_dokladu, ["6", "8"])){
            $type = 1;
        } else if ($model->_typ_dokladu == 9){
            $type = 2;
        }

        $suppliers_best = [];
        $suppliers_other = [];

        if ($type != -1){
            $query1 = Supplier::find()->joinWith("invoices")->groupBy("supplier.id")->orderBy("COUNT(invoice.id) DESC")->andWhere(["type" => $type])->limit(10);
            $query2 = Supplier::find()->joinWith("invoices")->groupBy("supplier.id")->orderBy("COUNT(invoice.id) DESC")->andWhere(["type" => $type])->offset(10);
            $suppliers_best = Supplier::find()->from([$query1])->orderBy("name")->all();
            $suppliers_other = Supplier::find()->from([$query2])->orderBy("name")->all();
        }

        $payments = \app\models\InvoicePay::find()->where(["id_invoice" => $model->id])->all();
        foreach ($payments as $cp){
            $cp->date_payment = date("d.m.Y", strtotime($cp->date_payment));
        }

        $post = Yii::$app->request->post();
        if ($model->load($post)) {
---
SELECT * FROM (SELECT `supplier`.* FROM `supplier` LEFT JOIN `invoice` ON `supplier`.`id` = `invoice`.`id_supplier` WHERE `type`=0 GROUP BY `supplier`.`id` ORDER BY COUNT(invoice.id) DESC LIMIT 10) `0` ORDER BY `name`
SELECT * FROM `invoice_pay` WHERE `id_invoice`=17467
SELECT `internal_number` FROM `invoice` WHERE SUBSTRING(CAST(internal_number as CHAR),1,1) = '2' AND SUBSTRING(CAST(internal_number as CHAR),2,1) = '5' AND SUBSTRING(CAST(internal_number as CHAR),3,2) = '16' ORDER BY `internal_number` DESC

    protected function findModel($id)
    {
        if (($model = Invoice::findOne($id)) !== null) {
---
SELECT * FROM `invoice` WHERE `id`='17467'

    public function actionSerialnumber($cislo_firmy, $typ_dokladu, $aktualny_uctovny_rok){
        $model = Invoice::find()->select("internal_number")->where(
                "SUBSTRING(CAST(internal_number as CHAR),1,1) = :cislo_firmy AND ".
                "SUBSTRING(CAST(internal_number as CHAR),2,1) = :typ_dokladu AND ".
                "SUBSTRING(CAST(internal_number as CHAR),3,2) = :aktualny_uctovny_rok",
                ['cislo_firmy' => $cislo_firmy, 'typ_dokladu' => $typ_dokladu, 'aktualny_uctovny_rok' => $aktualny_uctovny_rok]
                )->orderBy("internal_number DESC")->one();
---
SELECT `internal_number` FROM `invoice` WHERE SUBSTRING(CAST(internal_number as CHAR),1,1) = '2' AND SUBSTRING(CAST(internal_number as CHAR),2,1) = '5' AND SUBSTRING(CAST(internal_number as CHAR),3,2) = '20' ORDER BY `internal_number` DESC

    public function actionBankdata(){
        $post = Yii::$app->request->post();
        $id = $post["id"];
        $typ_dokladu = $post["typ_dokladu"];

        if (in_array($typ_dokladu, ["5", "7"])){
            $model = Supplier::find()->where(["id" => $id, "type" => 0])->one();
---
SELECT * FROM `supplier` WHERE (`id`='2176') AND (`type`=0)

    public function actionGetSuppliers(){
        $post = Yii::$app->request->post();

        $typ_dokladu = $post["typ_dokladu"];

        $type = -1;
        if (in_array($typ_dokladu, ["5", "7"])){
            $type = 0;
        } else if (in_array($typ_dokladu, ["6", "8"])){
            $type = 1;
        } else if (in_array($typ_dokladu, ["9"])){
            $type = 2;
        }

        $query1 = Supplier::find()->joinWith("invoices")->groupBy("supplier.id")->orderBy("COUNT(invoice.id) DESC")->andWhere(["type" => $type])->limit(10);
        $query2 = Supplier::find()->joinWith("invoices")->groupBy("supplier.id")->orderBy("COUNT(invoice.id) DESC")->andWhere(["type" => $type])->offset(10);
        $suppliers_best = Supplier::find()->from([$query1])->orderBy("name")->all();
---
SELECT * FROM (SELECT `supplier`.* FROM `supplier` LEFT JOIN `invoice` ON `supplier`.`id` = `invoice`.`id_supplier` WHERE `type`=0 GROUP BY `supplier`.`id` ORDER BY COUNT(invoice.id) DESC LIMIT 10) `0` ORDER BY `name`