controllers/MainController.php

SELECT * FROM `settings`
---
    public function init() {
        Yii::$app->language = "sk";
        // Get settings from database
        $db = (new \yii\db\Query);
        $settings = $db->select("*")->from("settings")->all();

INSERT INTO `log` (`id_user`, `controller`, `action`, `url`, `post`, `created_at`) VALUES (21, 'invoice', 'index', '/invoice/index', '[]', '2020-02-06 14:33:06')
---
    public function beforeAction($action) {
        if (!parent::beforeAction($action)) {
            return false;
        }

        if (Yii::$app->controller->action->id == "login" || Yii::$app->controller->action->id == "changepassword")
            return true;

        $log = new \app\models\Log();
        $log->id_user = Yii::$app->user->identity->id;
        $log->controller = Yii::$app->controller->id;
        $log->action = Yii::$app->controller->action->id;
        $log->url = \yii\helpers\Url::current();
        $log->post = \yii\helpers\Json::encode( \Yii::$app->request->post());
        $log->created_at = date("Y-m-d H:i:s");
        $log->save();