controllers/SettingsController.php

    public function actionIndex()
    {
//        $dataProvider = new ActiveDataProvider([
//            'query' => Settings::find(),
//        ]);
//
//        return $this->render('index', [
//            'dataProvider' => $dataProvider,
//        ]);

        $post = Yii::$app->request->post();

        if (isset($post['Settings'])){
            $models = [];
            $errors = [];
            foreach ($post["Settings"] as $setting => $value){
                /* @var $model Settings */
                $model = Settings::find()->where(["setting" => $setting])->one();
                $model->value = $value;
                $model->save();
                $models[] = $model;
                $errors[] = $model->errors;
            }
            return $this->render('index', [
                'models' => $models,
                'errors' => $errors,
            ]);
        }

        $models = Settings::find()->all();
---
SELECT * FROM `settings` WHERE `setting`='ACCOUNT_NUMBER'
UPDATE `settings` SET `value`='Print' WHERE `setting`='SITE_NAME'
SELECT * FROM `settings`