controllers/SupplierController.php

    public function actionIndexHome()
    {
        $searchModel = new SupplierSearch();
        $searchModel->type = 0;
        $searchModel->load(Yii::$app->request->get());
        $dataProvider = $searchModel->search(Yii::$app->request->get());
        $models = Supplier::find()->where(["type" => 0])->all();
---
SELECT * FROM `supplier` WHERE `type`=0