views/invoice-cart/index.php

SELECT * FROM `settings` WHERE `setting`='ACCOUNT_NUMBER'
---
$this->title = Yii::t('invoice_cart', 'To pay');
$this->params['breadcrumbs'][] = $this->title;

Yii::$app->params['ACCOUNT_NUMBER'] = app\models\Settings::find()->where(["setting" => "ACCOUNT_NUMBER"])->one()->value;