models/MainModel.php

    public static function getBICFromIBAN($iban){

        $iban = str_replace(" ", "", $iban);
        $kod = substr($iban, 4, 4);

        $bank = Bank::find()->where(["code" => $kod])->one();
---
SELECT * FROM `bank` WHERE `code`='1100'